readme.md

# Table of Contents

1.  [Networking](#org6492a26)
2.  [Emacs (Doom)](#org9d7f317)
3.  [Vim/Neovim](#org1177606)
4.  [Blender (2.8)](#orgda76513)
5.  [WordPress](#orge721c4a)
6.  [CSS](#org80a5132)
7.  [JavaScript](#org0646449)
8.  [Angular](#orgbd0ecae)
9.  [Org mode](#orgbb96a4c)
10. [Lua](#org6244e6a)
11. [Rust](#org339e0be)



<a id="org6492a26"></a>

# Networking

-   Basic Networking [Ben Eater](https://www.youtube.com/playlist?list=PLowKtXNTBypH19whXTVoG3oKSuOcw_XeW)
-   Explain with animation [Information Technology](https://www.youtube.com/playlist?list=PL7zRJGi6nMRzHkyXpGZJg3KfRSCrF15Jg)


<a id="org9d7f317"></a>

# Emacs (Doom)

-   [Zaiste Programming](https://www.youtube.com/playlist?list=PLhXZp00uXBk4np17N39WvB80zgxlZfVwj)
-   [Seorenn](https://www.youtube.com/playlist?list=PLPNohcoOBa5FT65hMZL6SkFmbyqFaLe3b)
-   [Evil Mode](https://www.youtube.com/watch?v=JWD1Fpdd4Pc)


<a id="org1177606"></a>

# Vim/Neovim

-   Practial Vim by Drew Neil
-   [ThePrimeagen](https://www.youtube.com/playlist?list=PLm323Lc7iSW_wuxqmKx_xxNtJC_hJbQ7R)


<a id="orgda76513"></a>

# Blender (2.8)

-   [Blender Fundamentals 2.8](https://www.youtube.com/playlist?list=PLa1F2ddGya_-UvuAqHAksYnB0qL9yWDO6)
-   [Blender Guru](https://www.youtube.com/playlist?list=PLjEaoINr3zgEq0u2MzVgAaHEBt--xLB6U)


<a id="orge721c4a"></a>

# WordPress

-   Create a free eCommerce Website  [Nayyar Shaikh](https://www.youtube.com/watch?v=1EYVO6NskAc&t=4903s)


<a id="org80a5132"></a>

# CSS

-   Creating layouts with CSS Grid by [ Matt Henry](https://www.pluralsight.com/courses/css-grid-creating-layouts)
-   A complete guide to flexbox[ CSS-TRICKS](https://css-tricks.com/snippets/css/a-guide-to-flexbox/)


<a id="org0646449"></a>

# JavaScript

-   [Event Loop](https://www.youtube.com/watch?v=8aGhZQkoFbQ)
-   [Learn with Sumit](https://www.youtube.com/channel/UCFM3gG5IHfogarxlKcIHCAg)
-   [Solid Principles](https://www.youtube.com/playlist?list=PLZlA0Gpn_vH9kocFX7R7BAe_CvvOCO_p9)
-   [Design Patterns](https://www.youtube.com/playlist?list=PLZlA0Gpn_vH_CthENcPCM0Dww6a5XYC7f)
-   You don&rsquo;t know JS by Kyle Simpson
-   Eloquent JavaScript by Marijn Haverbeke


<a id="orgbd0ecae"></a>

# Angular

-   Angular: Getting Started by [Deborah Kurata](https://www.pluralsight.com/courses/angular-2-getting-started-update)


<a id="orgbb96a4c"></a>

# Org mode

-   OrgMode tutorial [Rainer König](https://www.youtube.com/playlist?list=PLVtKhBrRV_ZkPnBtt_TD1Cs9PJlU0IIdE)


<a id="org6244e6a"></a>

# Lua

-   [Learn X in Y minutes](https://learnxinyminutes.com/docs/lua/)


<a id="org339e0be"></a>

# Rust

-   [Get started with Rust](https://docs.microsoft.com/en-us/learn/modules/rust-get-started/)
-   The Rush programming language by [Steve Klabnik and Carol Nichols](https://doc.rust-lang.org/book/)

